<?php
/*
 * 8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».
*/
$regions = [
    'Московская область' => [
        'Москва',
        'Зеленоград',
        'Клин'
    ],
    'Ленинградская область' => [
        'Санкт-Петербург',
        'Всеволожск',
        'Павловск',
        'Кронштадт'
    ],
    'Рязанская область' => [
        'Рязань',
        'Новомичуринск',
        'Скопин',
        'Спасск-Рязанский',
        'Сасово'
    ]
];

foreach ($regions as $region => $cities) {
    echo $region . ':<br>';
    foreach ($cities as $city) {
        if (str_starts_with($city, 'К')) {
            echo $city . '<br>';
        }
    }
    unset($cities, $city);
}
unset($region, $cities);
