<?php
/*
 * 4. Объявить массив, индексами которого являются буквы русского языка,
 *    а значениями – соответствующие латинские буквосочетания
 *    (‘а’=> ’a’, ‘б’=> ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
 *    Написать функцию транслитерации строк.
*/
$translit = [
    'а' => 'a', 'А' => 'A',
    'б' => 'b', 'Б' => 'B',
    'в' => 'v', 'В' => 'V',
    'г' => 'g', 'Г' => 'G',
    'д' => 'd', 'Д' => 'D',
    'е' => 'e', 'Е' => 'E',
    'ё' => 'yo', 'Ё' => 'Yo',
    'ж' => 'zh', 'Ж' => 'Zh',
    'з' => 'z', 'З' => 'Z',
    'и' => 'i', 'И' => 'I',
    'й' => 'j', 'Й' => 'J',
    'к' => 'k', 'К' => 'K',
    'л' => 'l', 'Л' => 'L',
    'м' => 'm', 'М' => 'M',
    'н' => 'n', 'Н' => 'N',
    'о' => 'o', 'О' => 'O',
    'п' => 'p', 'П' => 'P',
    'р' => 'r', 'Р' => 'R',
    'с' => 's', 'С' => 'S',
    'т' => 't', 'Т' => 'T',
    'у' => 'u', 'У' => 'U',
    'ф' => 'f', 'Ф' => 'F',
    'х' => 'h', 'Х' => 'H',
    'ц' => 'c', 'Ц' => 'C',
    'ч' => 'ch', 'Ч' => 'Ch',
    'ш' => 'sh', 'Ш' => 'Sh',
    'щ' => 'shch', 'Щ' => 'Shch',
    'ъ' => '"', 'Ъ' => '"',
    'ы' => 'y', 'Ы' => 'Y',
    'ь' => '\'', 'Ь' => '\'',
    'э' => 'e', 'Э' => 'E',
    'ю' => 'yu', 'Ю' => 'Yu',
    'я' => 'ya', 'Я' => 'Ya'
];

function transliteration($txt, $translit): string {
    $txt = mb_str_split($txt);
    foreach ($txt as &$item) {
        foreach ($translit as $key => $value) {
            if ($item === $key) {
                $item = $value;
            }
        }
        unset($key, $value);
    }
    unset($item);
    return implode('', $txt);
}

echo transliteration('Привет, ПХП!!!', $translit);
